0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{

    inlet
    {
        type            freestream;
     //   inletValue      $internalField;
        freestreamValue           $internalField;
    }


    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    frontAndBack
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    topAndBottom
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    roket
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    /*nozzle
    {
        type            freestream;
      //  inletValue      $internalField;
        freestreamValue           $internalField;
    }*/

}


// ************************************************************************* //
