system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(tauMC) Gauss linear;
    div(phi,U)      bounded Gauss linearUpwind grad(U); 
    div(phi,e)      leastSquares;//Gauss upwind 1;
    div(phid,p)     leastSquares limitedLinear 1;
    div(phi,K)      leastSquares limitedLinear 1;
    div(phiv,p)     leastSquares limitedLinear 1;
    div(phi,k)      bounded Gauss upwind; //tyrb
    div(phi,epsilon) bounded Gauss upwind; 
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear; 
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    reconstruct(rho) upwind;
    reconstruct(U)  upwind;
    reconstruct(T)  upwind;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
